Revit 2027 API
BuiltInFailures.DesignOptionFailures.CannotPutSpaceInOption Property
 MEP space must be in the Main Model
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPutSpaceInOption { get; }
Public Shared ReadOnly Property CannotPutSpaceInOption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPutSpaceInOption {
	FailureDefinitionId^ get ();
}
static member CannotPutSpaceInOption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace